import sqlite3

conn = sqlite3.connect('db.sqlite')
c = conn.cursor()

city_names = ['Москва', 'Астрахань', 'Барнаул', 'Владивосток', 'Волгоград', 'Воронеж', 'Екатеринбург', 'Ижевск', 'Иркутск', 'Казань', 'Кемерово', 'Краснодар', 'Красноярск', 'Липецк', 'Махачкала', 'Набережные Челны', 'Нижний Новгород', 'Новокузнецк', 'Новосибирск', 'Омск', 'Оренбург', 'Пенза', 'Пермь', 'Ростов-на-Дону', 'Рязань', 'Самара', 'Санкт-Петербург', 'Саратов', 'Тольятти', 'Томск', 'Тюмень', 'Ульяновск', 'Уфа', 'Хабаровск', 'Челябинск', 'Ярославль']

for i in range(len(city_names)):
	c.execute('''INSERT INTO weather (city, temp_now, max_temp, min_temp) VALUES ('{}', '{}','{}', '{}')'''.format(city_names[i], 0, 0, 0))
	conn.commit()

c.close()
conn.close()